<template>
  <div class="tt-main-page">
      <ttOpenTab
          @click.native="goTo(index)"
        v-for="(item,index) in tabs"
        :key="index"
        :item="item"/>
    <div class="title-of-article" style="margin: 21px 0 13px">
      О нас
    </div>
    <div>
      <p style="line-height: 17px">Скорость нашей жизни растет с каждым годом: для того, чтобы быть эффективными, мы должны постоянно находится в тонусе; быстро реагировать на изменения. Время сегодня — самая ценная валюта; чтобы сберечь его, мы сокращаем слова, встречаемся только по делу, а многозадачность воспринимаем как трудовую норму.</p>
      <p>Конструктор еды поможет освободить часть драгоценного времени, которого нам зачастую не хватает,  на общение с друзьями и близкими; или на отдых в уединении.</p>
      <br>
      <p>Проведите уютный вечер с родными, или пригласите в гости друзей, уделив подготовке минимум усилий и времени:</p>
      <p>— выбирайте блюдо на сайте Ужин дома;</p>
      <p>— заказывайте ингредиенты на нужное Вам количество порций;</p>
      <p>— получите в течение 3−4 часов доставку свежих продуктов и пошаговый рецепт;</p>
      <p>— готовьте фантастические блюда не дольше чем за 30 минут.</p>
      <br>
      <p>Поверьте, ускоренный процесс приготовления доставит Вам удовольствие!</p>
    </div>
  </div>
</template>

<script>
import ttOpenTab from "./tt-open-tab";

export default {
  name: "tt-main-page",
  components: {
    ttOpenTab
  },
  data() {
    return {
      tabs: [
        {
          title: 'Конструктор еды',
          imag: 'img1'
        },
        {
          title: 'Сеты',
          imag: 'img2'
        },
        {
          title: 'Магазин',
          imag: 'img3'
        }
      ]
    }
  },
  methods: {
    goTo(index) {
      if(index===0)this.$router.push('/constructor');
    }
  },
  mounted() {
    this.$store.commit('HIDE_FOOTER', false);
  }
}
</script>

<style scoped>

</style>